//********************************************************* 
/*	文件名：TEST_FT62F21x_PWM1.c
*	功能：	 FT62F21x-PWM1功能演示
*	IC:		 FT62F211 SOP8
*	晶振：   16M/4T                    
*	说明：   P1A0输出10kHz占空比50%的波形(实测9.8kHz)
*
*                  FT62F211 SOP8 
*                 ----------------
*  NC-----------|1(PA4)      (PA3)8|------------P1A0    
*  NC-----------|2(TKCAP)  (PA0)7|------------NC
*  VDD----------|3(VDD)     (PA1)6|------------NC
*  GND----------|4(VSS)     (PA2)5|------------NC
*			      ----------------
*/
//*********************************************************
#include	"SYSCFG.h";
#include 	"FT62F21X.h";
//*********************************************************
#define OSC_16M		0X70
#define OSC_8M		0X60
#define OSC_4M		0X50
#define OSC_2M		0X40
#define OSC_1M		0X30
#define OSC_500K	0X20
#define OSC_250K	0X10
#define OSC_32K		0X00

#define WDT_256K	0X80
#define WDT_32K		0X00
//**********************************************************
//***********************宏定义*****************************
#define  unchar     unsigned char 
#define  unint      	unsigned int
#define  unlong     unsigned long
/*-------------------------------------------------
 *	函数名：中断处理程序
 *	功能：   定时器2中断
 *	输入：   无
 *	输出：   无
 --------------------------------------------------*/
void interrupt ISR(void)			//PIC_HI-TECH使用
{ 
   
  //定时器2的中断处理**********************
	if(TMR2IE && TMR2IF)			//100us中断一次 
	{
		TMR2IF = 0;

		//DemoPortOut = ~DemoPortOut; //翻转电平
	} 
}
 /*-------------------------------------------------
 *	函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *	输入：  无
 *	输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	OSCCON = WDT_32K|OSC_16M|0X00;	
  //OSCCON = 0B01110000;		//WDT 32KHZ IRCF=111=16MHZ/4=4MHZ,0.25US/T

	INTCON = 0;  							//暂禁止所有中断

	PORTA = 0B00000000;				
	TRISA = 0B00000000;				//PA输入输出 0-输出 1-输入  
	WPUA = 0B00000000;     		//PA端口上拉控制 1-开上拉 0-关上拉

	OPTION = 0B00001000;			//Bit3=1 WDT MODE,PS=000=1:1 WDT RATE
													//Bit7(PAPU)=0 由WPUA决定是否上拉
	MSCON = 0B00000000;		                             
}
 /*-------------------------------------------------
 *  函数名称：DelayUs
 *  功能：    短延时函数 --16M-4T--大概快1%左右.
 *  输入参数：Time 延时时间长度 延时时长Time*2 Us
 * 	返回参数：无 
 -------------------------------------------------*/
void DelayUs(unsigned char Time)
{
	unsigned char a;
	for(a=0;a<Time;a++)
	{
		NOP();
	}
}                  
/*------------------------------------------------- 
 * 	函数名称： DelayMs
 * 	功能：    短延时函数
 * 	输入参数：Time 延时时间长度 延时时长Time ms
 * 	返回参数：无 
 -------------------------------------------------*/
void DelayMs(unsigned char Time)
{
	unsigned char a,b;
	for(a=0;a<Time;a++)
	{
		for(b=0;b<5;b++)
		{
		 	DelayUs(98);               //快1%
		}
	}
}
/*------------------------------------------------- 
 * 	函数名称：DelayS
 * 	功能：   短延时函数
 * 	输入参数：Time 延时时间长度 延时时长Time S
 * 	返回参数：无 
 -------------------------------------------------*/
void DelayS(unsigned char Time)
{
	unsigned char a,b;
	for(a=0;a<Time;a++)
	{
		for(b=0;b<10;b++)
		{
		 	DelayMs(100); 
		}
	}
}
/*-------------------------------------------------
 *	函数名: PWM1_INITIAL 
 *	功能：  PWM1初始化函数
 *	输入：  无
 *	输出：  无
 --------------------------------------------------*/
void PWM1_INITIAL(void)
{
	T2CON0=0B00000001;	//T2预分频1:4，后分频1:1
    //BIT7: 0：无意义； 1：把PR2/P1xDTy缓冲值分别更新到PR2寄存器和P1xDTy_ACT
    //BIT6~BIT3: 定时器2输出后分频比选择 0000:1:1;0001:1:2;……1:16
    //BIT2:0:关闭定时器2；1：打开定时器2
    //BIT1~0:定时器2预分频选择 00:1;01:4;1x:16
    
    T2CON1=0B00000000;	//T2时钟来自系统时钟，PWM连续模式
    //BIT4: PWM模式选择 0:连续模式；1：单脉冲模式
    //BIT3: 0:PWM模式；1：蜂鸣器模式	
    //Timer2时钟源选择：000：指令时钟；001：系统时钟；010：HIRC的2倍频；100：HIRC；101：LIRC
    
    TMR2H=0;						//定时器2计数寄存器
    TMR2L=100;
    
    PR2H=0;							//周期=（PR2+1）*Tt2ck*TMR2预分频
    PR2L=100;
    
    P1ADTH=0;						//脉宽=P1xDT*Tt2ck*TMR2预分频
    P1ADTL=50;
    
    P1OE=0B00000001;		//P1A0输出使能
	//BIT7: 0:禁止P1C输出到管脚;1:允许P1C输出到管脚
    //BIT6: 0:禁止P1B输出到管脚;1:允许P1B输出到管脚
    //BIT6: 0:禁止P1D输出到管脚;1:允许P1D输出到管脚
    //BIT3~BIT2: 故障下，[P1C]管脚的状态，只有当P1CALT为1时才有效 00=高阻  01=输出0  1x=输出1
    //BIT1: 0:禁止P1A0N输出到管脚;1:允许P1A0N输出到管脚
    //BIT0: 0:禁止P1A0输出到管脚;1:允许P1A0输出到管脚    
 
   P1POL=0B00000000;		//P1A0高电平有效
    //BIT7: 0:P1C高电平有效;1:P1C低电平有效
    //BIT6: 0:P1B高电平有效;1:P1B低电平有效
    //BIT5: 0:P1D高电平有效;1:P1D低电平有效
    //BIT1: 0:P1A0N高电平有效;1:P1A0N低电平有效
    //BIT0: 0:P1A0高电平有效;1:P1A0低电平有效
    
    P1CON=0B00000000;
    //BIT7:PWM1 重启使能位
	//1 = 故障刹车时，P1BEVT位在退出关闭事件时自动清零，PWM1自动重启
	//0 = 故障刹车时，必须用软件将P1BEVT清零以重启PWM1
    //BIT6~0:PWM1死区时间设置
	//P1DCn = 预定MPWM信号应转变为有效与PWM信号实际转为有效之间的T2CK周期数
    
    TMR2IF=0;						//清TIMER2中断标志
    TMR2IE=1;						//使能TIMER2的中断
    TMR2ON=1;						//打开定时器2
    PEIE=1;							//使能外设中断
    GIE=1;								//使能全局中断
    
}
/*-------------------------------------------------
 *	函数名: main 
 *	功能：  主函数
 *	输入：  无
 *	输出：  无
 --------------------------------------------------*/
void main()
{
	POWER_INITIAL();				//系统初始化
    PWM1_INITIAL();					//初始化PWM1
	while(1)
	{
		NOP();
	}
}
