//********************************************************* 
/*  文件名：Test_62F21X_Timer0.c
*	功能：  FT62F21X_Timer0功能演示
*   IC:    FT62F21X SOP8 
*   晶振：  16M/4T                    
*   说明：  DemoPortOut输出30Hz占空比50%的波形-Timer0实现
*
* Memory: Flash 1KX14b, EEPROM 128X8b, SRAM 64X8b
*                  							FT62F21X SOP8 
*                 								----------------
*  DemoPortOut ------------|1(PA4)    		 	(PA3)8 |-------------NC 
*  NC------------|2(TKCAP)   	 					(PA0)7 |-------------NC
*  NC------------|3(VDD)								(PA1)6 |-------------NC 
*  NC------------|4(VSS)   	 						(PA2)5	|-------------DemoPortIn
*			     								 ----------------
*/
//===========================================================
//===========================================================
#include	"SYSCFG.h";
#include 	"FT62F21X.h";

#define  unchar     unsigned char 
#define  unint      unsigned int
#define  unlong     unsigned long

//===========================================================
//
//	系统时钟
//===========================================================
#define OSC_16M  0X70
#define OSC_8M   0X60
#define OSC_4M   0X50
#define OSC_2M   0X40
#define OSC_1M   0X30
#define OSC_500K 0X20
#define OSC_250K 0X10
#define OSC_32K  0X00

#define  DemoPortOut	RA4   
//===========================================================
//变量定义
//===========================================================

/*-------------------------------------------------
 * 函数名： interrupt ISR
 *	功能：  中断处理
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)
{
    if(INTCON & 0x04)	//Timer0 interrupt flag 	Bit[2]		T0IF
    {
		DemoPortOut = ~DemoPortOut;
        INTCON &= ~(1<<2);	//T0IF = 0;	
        TMR0 =0; 	//计数初值 每个指令周期++	最大255，后溢出
	}
}

/*----------------------------------------------------
 *	函数名称：  TIMER0_INITIAL
 *	功能：     初始化设置定时器
 *	相关寄存器：T0CS T0SE PSA 	指令周期 = 4*时钟周期
 *	设置TMR0定时时长 16ms=(1/16000000)*256*255 *4(16M-4T-PSA 1:256- TMR0=255溢出)	                      
 ----------------------------------------------------*/
 void TIMER0_INITIAL (void)  
 {
     T0ON = 0;
     TMR0 = 0; //计数初值 每个指令周期++	最大255，后溢出
     T0CON0 = 0B00000000;	//Bit3 定时器0使能位		Bit[1:0]定时器时钟源选择位	00:指令周期	01:HIRC
     OPTION = 0B00000111;	
											//Bit5 T0CS Timer0时钟源选择 
											//1-外部引脚电平变化T0CKI 0-内部时钟(FOSC/2)
											//Bit4 T0CKI引脚触发方式 1-下降沿 0-上升沿
											//Bit3 PSA 预分频器分配位 0-Timer0 1-WDT 
											//Bit2:0 PS2 8个预分频比 111 - 1:256                                           
	T0ON = 1;
}
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{ 
	OSCCON = OSC_16M;	//	bit7	Timer2 选择LIRC为时钟源时 LIRC的频率选择  0:32KHz	1:256KHz
										//bit[6:4]	系统频率选择	
										//bit[2]		高速内部时钟状态	1:ready	0:not ready
										//bit[1]		低速内部时钟状态	1:ready	0:not ready

	INTCON = 0;  				//暂禁止所有中断
	OPTION = 0;
    TRISA	= 0;					//1:输入	0:输出		
    PSRCA 	= 0;					//00:	4mA		01/10:	8mA		11:	28mA	bit[3:2]控制PA5源电流	bit[1:0]控制PA4源电流
    PSINKA	= 0;					//bit[1:0]	控制PA5和PA4		0:灌电流最小	1:灌电流最大
    PORTA 	= 0;					//1:PAx输出高电平	0:PAx输出低电平
 	WPUA 	= 0;					//1:	使能PA口上拉	0:关闭PA口上拉   
}

/*-------------------------------------------------
 * 函数名: main 
 *	功能：  主函数
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main()
{
    POWER_INITIAL();//系统初始化
    
    TIMER0_INITIAL();
    
	GIE = 1; 				//开中断
	T0IE = 1;				//开定时器/计数器0中断    
    
	while(1)
    {
		NOP();
	}
}
//===========================================================
