//********************************************************* 
/*  文件名：Test_62F21X_MSCK.c
*	功能：  FT62F21X_MSCK功能演示
*   IC:    FT62F21X SOP8 
*   晶振：  16M/4T                    
*   说明： 慢时钟测量结果存储在相关寄存器中，程序读取出
* Memory: Flash 1KX14b, EEPROM 128X8b, SRAM 64X8b
*                  							FT62F21X SOP8 
*                 								----------------
*  DemoPortOut ------------|1(PA4)    		 	(PA3)8 |-------------NC 
*  NC------------|2(TKCAP)   	 					(PA0)7 |-------------NC
*  NC------------|3(VDD)								(PA1)6 |-------------NC 
*  NC------------|4(VSS)   	 						(PA2)5	|-------------DemoPortIn
*			     								 ----------------
*/
//===========================================================
//===========================================================
#include	"SYSCFG.h";
#include 	"FT62F21X.h";

//===========================================================
//
//	系统时钟
//===========================================================
#define OSC_16M  0X70
#define OSC_8M   0X60
#define OSC_4M   0X50
#define OSC_2M   0X40
#define OSC_1M   0X30
#define OSC_500K 0X20
#define OSC_250K 0X10
#define OSC_32K  0X00

//===========================================================
//变量定义
//===========================================================
unsigned int temp;

//===========================================================
//Funtion name：interrupt ISR
//parameters：无
//returned value：无
//===========================================================
void interrupt ISR(void)
{
    
}
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{ 
	OSCCON = OSC_16M;	//	bit7	Timer2 选择LIRC为时钟源时 LIRC的频率选择  0:32KHz	1:256KHz
										//bit[6:4]	系统频率选择	
										//bit[2]		高速内部时钟状态	1:ready	0:not ready
										//bit[1]		低速内部时钟状态	1:ready	0:not ready

	INTCON = 0;  				//暂禁止所有中断
	OPTION = 0;
    TRISA	= 0;					//1:输入	0:输出	
    PSRCA 	= 0;					//00:	4mA		01/10:	8mA		11:	28mA		bit[3:2]控制PA5源电流	bit[1:0]控制PA4源电流
    PSINKA	= 0;					//bit[1:0]	控制PA5和PA4		0:灌电流最小	1:灌电流最大
    PORTA 	= 0;					//1:PAx输出高电平	0:PAx输出低电平	
 	WPUA 	= 0;					//1:	使能PA口上拉	0:关闭PA口上拉   
}
void MSCK_Init(void)
{
    TMR2ON = 1;	//打开Timer2
    
	CKMAVG = 0;	//MSCON = (0<<2);	//Bit[2]  打开/关闭4次平均	0:关闭	1:打开
        
}
/*-------------------------------------------------
 * 函数名: main 
 *	功能：  主函数
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main()
{
    POWER_INITIAL();	//系统初始化
    
	MSCK_Init();			//慢时钟测量初始化
    
	CKCNTI = 1;				//开始测量
	
	while(1)
    {
        if(CKMIF)				//慢时钟测量完成中断标志位  查询方式
		{
            temp = (SOSCPRH &0x0f)<<8;
            temp |= SOSCPRL;
              
            CKMIF = 0;
		}
		NOP();
        
	}
}
//===========================================================
