//********************************************************* 
/*  ÎÄ¼þÃû£ºTest_62F21X_UART.c
*	¹¦ÄÜ£º 	 	FT62F21X_UART¹¦ÄÜÑÝÊ¾
*   IC:   	 	FT62F21X SOP8
*   ¾§Õñ£º  16M/4T                    
*   ËµÃ÷£º  ÑÝÊ¾³ÌÐòÖÐ²¨ÌØÂÊÎª9600£¬RXIO£¨PA0£©Ã¿´ÎÊÕµ½Íâ²¿´®¿Ú·¢¹ýÀ´µÄÊý¾Ýºó£¬TXIO(PA4)
*		   °ÑÊÕµ½µÄÊý¾ÝÔÙ·¢ËÍ³öÈ¥¡£½ÓÊÕÆðÊ¼Î»Ê±ÊÇÓÃµçÆ½±ä»¯ÖÐ¶ÏÊ¶±ð£¬ºóÃæ¹Ø±ÕµçÆ½±ä»¯ÖÐ¶Ï¡£½
* Memory: Flash 1KX14b, EEPROM 128X8b, SRAM 64X8b
*                  							FT62F21X SOP8 
*                 								----------------
*  DemoPortOut ------------|1(PA4)    		 	(PA3)8 |-------------NC 
*  NC------------|2(TKCAP)   	 					(PA0)7 |-------------NC
*  NC------------|3(VDD)								(PA1)6 |-------------NC 
*  NC------------|4(VSS)   	 						(PA2)5	|-------------DemoPortIn
*			     								 ----------------
*/
//===========================================================
//===========================================================
#include	"SYSCFG.h";
#include 	"FT62F21X.h";

// ºê¶¨Òå
#define  uchar		unsigned char 
#define  uint			unsigned int
#define  ulong		unsigned long

#define  TXIO		RA4  	//´®¿ÚµÄ·¢ËÍ½Å
#define  RXIO		RA2  	//´®¿ÚµÄ½ÓÊÕ½Å

#define  Bord		49 		//Í¨¹ý¶¨Ê±Æ÷Ìá¹©²¨ÌØÂÊ

//===========================================================
//
//	ÏµÍ³Ê±ÖÓ
//===========================================================
#define OSC_16M  0X70
#define OSC_8M   0X60
#define OSC_4M   0X50
#define OSC_2M   0X40
#define OSC_1M   0X30
#define OSC_500K 0X20
#define OSC_250K 0X10
#define OSC_32K  0X00

//===========================================================
//±äÁ¿¶¨Òå
//===========================================================
uchar RXFLAG = 0;
uchar ReadAPin;

/*-------------------------------------------------
 *  º¯ÊýÃû£º interrupt ISR
 *	¹¦ÄÜ£º  ÖÐ¶Ï´¦Àí£¬°üÀ¨¶¨Ê±Æ÷0ÖÐ¶ÏºÍÍâ²¿ÖÐ¶Ï
 *  ÊäÈë£º  ÎÞ
 *  Êä³ö£º  ÎÞ
 *	ËµÃ÷£º  ¶¨Ê±Æ÷²úÉú104uSÖÐ¶Ï£¬¶ÔÓ¦9600µÄ²¨ÌØÂÊ 1000000¡Â9600=104
 --------------------------------------------------*/
void interrupt ISR(void)
{
   
  //¶¨Ê±Æ÷0µÄÖÐ¶Ï´¦Àí**********************
	if(T0IE && T0IF)		//104us
	{
		TMR0 = Bord;		//×¢Òâ:¶ÔTMR0ÖØÐÂ¸³ÖµTMR0ÔÚÁ½¸öÖÜÆÚÄÚ²»±ä»¯
		 
		T0IF = 0;
        T0IE = 0;
	} 
    
    //PAµçÆ½±ä»¯ÖÐ¶Ï**********************
	if(PAIE && PAIF)		
    {
		ReadAPin = PORTA; 	//¶ÁÈ¡PORTAÊý¾ÝÇåPAIF±êÖ¾
		PAIF = 0;  			//ÇåPAIF±êÖ¾Î»
		if(RXIO == 0)
        {
        	PAIE = 0;  		//ÔÝÏÈ½ûÖ¹PAµçÆ½±ä»¯ÖÐ¶Ï
			IOCA2 =0;  		//½ûÖ¹PA2µçÆ½±ä»¯ÖÐ¶Ï
            RXFLAG = 1;
        } 
    }    
}
/*-------------------------------------------------
 *  º¯ÊýÃû£ºPOWER_INITIAL
 *	¹¦ÄÜ£º  ÉÏµçÏµÍ³³õÊ¼»¯
 *  ÊäÈë£º  ÎÞ
 *  Êä³ö£º  ÎÞ
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{ 
	OSCCON = OSC_16M;	//	bit7	Timer2 Ñ¡ÔñLIRCÎªÊ±ÖÓÔ´Ê± LIRCµÄÆµÂÊÑ¡Ôñ  0:32KHz	1:256KHz
										//bit[6:4]	ÏµÍ³ÆµÂÊÑ¡Ôñ	
										//bit[2]		¸ßËÙÄÚ²¿Ê±ÖÓ×´Ì¬	1:ready	0:not ready
										//bit[1]		µÍËÙÄÚ²¿Ê±ÖÓ×´Ì¬	1:ready	0:not ready

	INTCON = 0;  				//ÔÝ½ûÖ¹ËùÓÐÖÐ¶Ï
	
    TRISA	= 1<<2;			//1:ÊäÈë	0:Êä³ö			PA2ÎªÊäÈëÄ£Ê½	PA4Êä³öÄ£Ê½
    PSRCA 	= 0;					//00:	4mA		01/10:	8mA		11:	28mA		bit[3:2]¿ØÖÆPA5Ô´µçÁ÷	bit[1:0]¿ØÖÆPA4Ô´µçÁ÷
    PSINKA	= 0;					//bit[1:0]	¿ØÖÆPA5ºÍPA4		0:¹àµçÁ÷×îÐ¡	1:¹àµçÁ÷×î´ó
    PORTA 	= 0;					//1:PAxÊä³ö¸ßµçÆ½	0:PAxÊä³öµÍµçÆ½	
 	WPUA 	= 1<<2;			//1:	Ê¹ÄÜPA¿ÚÉÏÀ­	0:¹Ø±ÕPA¿ÚÉÏÀ­   
}
/*----------------------------------------------------
 *	º¯ÊýÃû£ºTIMER0_INITIAL
 *	¹¦ÄÜ£º  ³õÊ¼»¯ÉèÖÃ¶¨Ê±Æ÷
 *	ÊäÈë£º  ÎÞ
 * Êä³ö£º  ÎÞ
 *	ËµÃ÷£º  ÉèÖÃTMR0¶¨Ê±Ê±³¤104us=(1/16000000)*4*2*208(16M-2T-PSA 1:2- TMR0=255Òç³ö)	                      
 ----------------------------------------------------*/
void TIMER0_INITIAL (void)  
{
	OPTION = 0B00000000;   //Bit5 T0CS Timer0Ê±ÖÓÔ´Ñ¡Ôñ 
											//1-Íâ²¿Òý½ÅµçÆ½±ä»¯T0CKI 0-ÄÚ²¿Ê±ÖÓ(FOSC/2)
											//Bit4 T0CKIÒý½Å´¥·¢·½Ê½ 1-ÏÂ½µÑØ 0-ÉÏÉýÑØ
											//Bit3 PSA Ô¤·ÖÆµÆ÷·ÖÅäÎ» 0-Timer0 1-WDT 
											//Bit2:0 PS2 8¸öÔ¤·ÖÆµ±È 000 - 1:2
	TMR0 = Bord; 
    T0IF = 0;							//Çå¿ÕT0Èí¼þÖÐ¶Ï
    T0ON = 1;
}

/*-------------------------------------------------
 * º¯ÊýÃû: PA0_Level_Change_INITIAL
 *	¹¦ÄÜ£º  PA¶Ë¿Ú(PA2)µçÆ½±ä»¯ÖÐ¶Ï³õÊ¼»¯
 * ÊäÈë£º  ÎÞ
 * Êä³ö£º  ÎÞ
--------------------------------------------------*/
void PA2_Level_Change_INITIAL(void)
{
	TRISA2 =1; 				//SET PA2 INPUT
	ReadAPin = PORTA;	//ÇåPAµçÆ½±ä»¯ÖÐ¶Ï
	PAIF =0;   				//ÇåPA INTÖÐ¶Ï±êÖ¾Î»
    IOCA2 =1;  				//Ê¹ÄÜPA2µçÆ½±ä»¯ÖÐ¶Ï
	PAIE =1;   				//Ê¹ÄÜPA INTÖÐ¶Ï
  //GIE =1;    				//Ê¹ÄÜÈ«¾ÖÖÐ¶Ï
}

//
/*-------------------------------------------------
 * º¯ÊýÃû£º WaitTF0
 *	¹¦ÄÜ£º  ²éÑ¯¶¨Ê±Æ÷Òç³öºó£¬ÔÚÖÐ¶ÏÀï¹Ø±Õ¶¨Ê±Æ÷ºó£¬ÔÙ´Î´ò¿ª¶¨Ê±Æ÷
 * ÊäÈë£º  ÎÞ
 * Êä³ö£º  ÎÞ
 --------------------------------------------------*/
void WaitTF0( void )
{
     while(T0IE);
     T0IE=1;
}

/*-------------------------------------------------
 * º¯ÊýÃû£º WByte
 * ¹¦ÄÜ£º  UART·¢ËÍÒ»¸ö×Ö½Ú
 * ÊäÈë£º  input
 * Êä³ö£º  ÎÞ
 --------------------------------------------------*/
void WByte(uchar input)
{
									//·¢ËÍÆðÊ¼Î»
	uchar i=8;
	TXIO = 1;
	TMR0 = Bord;
	T0IE = 1;  
	WaitTF0(); 
	TXIO=0;
	WaitTF0();
									//·¢ËÍ8Î»Êý¾ÝÎ»
	while(i--)
	{
		if(input&0x01) 		//ÏÈ´«µÍÎ»
		{
			TXIO=1;
		}
		else
		{
			TXIO = 0;
		}    
		WaitTF0();
		input=input>>1;
	}
									//·¢ËÍÐ£ÑéÎ»(ÎÞ)
									//·¢ËÍ½áÊøÎ»
	TXIO=(bit)1;
	T0IE=0;
} 

/*-------------------------------------------------
 * º¯ÊýÃû£º RByte
 *	¹¦ÄÜ£º  UART½ÓÊÕÒ»¸ö×Ö½Ú
 * ÊäÈë£º  ÎÞ
 * Êä³ö£º  Output
 --------------------------------------------------*/
uchar RByte()
{
	uchar Output=0;
	uchar i=8;
	T0IE=1;               			 //Æô¶¯Timer0
	TMR0 = Bord;
	WaitTF0();
	T0IE=1;                		//Æô¶¯Timer0
	TMR0 = Bord;
	WaitTF0();           			//µÈ¹ýÆðÊ¼Î»
										//·¢ËÍ8Î»Êý¾ÝÎ»
	while(i--)
	{
		Output >>=1;
		if(RXIO) 
        {
        	Output|=0x80;   	//ÏÈÊÕµÍÎ»
        }
		WaitTF0();          		//Î»¼äÑÓÊ±
	}
	T0IE=0;                 		//Í£Ö¹Timer0
	return Output;
}

/*-------------------------------------------------
 * º¯ÊýÃû: main 
 *	¹¦ÄÜ£º  Ö÷º¯Êý
 * ÊäÈë£º  ÎÞ
 * Êä³ö£º  ÎÞ
 --------------------------------------------------*/
void main()
{
	uchar rdata = 0;
    
	POWER_INITIAL();
    
    TIMER0_INITIAL();
    PA2_Level_Change_INITIAL();
    GIE = 1; 						//¿ªÖÐ¶Ï
	T0IE = 1;						//¿ª¶¨Ê±Æ÷/¼ÆÊýÆ÷0ÖÐ¶Ï
    while(1)
    {
        if(RXFLAG)				//Íâ²¿ÖÐ¶ÏÏÂ½µÑØ´¥·¢ÁË
        {
        	rdata = RByte();
            WByte(rdata);
        
            IOCA2 =1;  			//Ê¹ÄÜPA2µçÆ½±ä»¯ÖÐ¶Ï
			PAIE =1;   			//Ê¹ÄÜPA INTÖÐ¶Ï
            RXFLAG = 0;
        }
    }    
}
//===========================================================
